Revit 2024 API
RoutingPreferenceRuleGroupType Enumeration
 Add more rule group type here.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Since: 2013
Syntax
C#
public enum RoutingPreferenceRuleGroupType
Visual Basic
Public Enumeration RoutingPreferenceRuleGroupType
Visual C++
public enum class RoutingPreferenceRuleGroupType
Members
Member name | Description
Undefined |  The undefined group type, the default initial value.
Segments |  The segment types (e.g. pipe stocks)
Elbows |  The elbow types.
Junctions |  The junction types (e.g. takeoff, tee, wye, tap).
Crosses |  The cross types.
Transitions |  The transition types (Note that the multi-shape transitions may have their own groups).
Unions |  The union types that connect two segments together.
MechanicalJoints |  The mechanical joint types that connect fitting to fitting, segment to fitting, or segment to segment.
TransitionsRectangularToRound |  The multi-shape transition from the rectangular profile to the round profile.
TransitionsRectangularToOval |  The multi-shape transition from the rectangular profile to the oval profile.
TransitionsOvalToRound |  The multi-shape transition from the oval profile to the round profile.
Caps |  The cap types
See Also
Autodesk.Revit.DB Namespace